sabre_docs/GetPassengerDataRQ_v4-0-4_Samples/GetPassengerDataRQ_v4-0-2_SamplePayload_4_2_6.xml.xml

<SamplePayloads>
	<!--Request-->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sec="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:mes="http://www.ebxml.org/namespaces/messageHeader" xmlns:v4="http://services.sabre.com/checkin/getPassengerData/v4">
   <soapenv:Header>
  <eb:MessageHeader eb:id="" eb:version="1.0" xmlns:eb="http://www.ebxml.org/namespaces/messageHeader">
   <eb:From>
    <eb:PartyId eb:type="URI">Client</eb:PartyId>
   </eb:From>
   <eb:To>
    <eb:PartyId eb:type="URI">Server</eb:PartyId>
   </eb:To>
   <eb:CPAId>IPCC</eb:CPAId>
   <eb:ConversationId>9DB7_921682_1204548352874</eb:ConversationId>
   <eb:Service>GetPassengerDataRQ</eb:Service>
   <eb:Action>GetPassengerDataRQ</eb:Action>
   <eb:MessageData>
    <eb:MessageId>mid:1</eb:MessageId>
    <eb:Timestamp>2008-03-03T12:45:52</eb:Timestamp>
   </eb:MessageData>
  </eb:MessageHeader>
  <wsse:Security xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext">
   <wsse:BinarySecurityToken EncodingType="wsse:Base64Binary" valueType="String">${#TestCase#BST}</wsse:BinarySecurityToken>
  </wsse:Security>
 </soapenv:Header>
   <soapenv:Body>
      <v4:GetPassengerDataRQ validateCheckInRequirements="true" includeTimaticInfo="false"  version="4.0.2">
         <!--You have a CHOICE of the next 2 items at this level-->
       <ItineraryAndPassengerInfo>
	<Itinerary>
		<Airline>EY</Airline>
		<Flight>7</Flight>
		<DepartureDate>2017-02-09</DepartureDate>
		<Origin>AUH</Origin>
	</Itinerary>
	<PassengerList>
	<Passenger>
			<LastName>DAVIES</LastName>
			<PNRLocator nameAssociationID="1">RLDSWM</PNRLocator>
		</Passenger>
		
	</PassengerList>
    </ItineraryAndPassengerInfo>
           <Client>KIOSK</Client>
      </v4:GetPassengerDataRQ>
   </soapenv:Body>     
        
</soapenv:Envelope>

<!--Response -->


<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
   <soap-env:Header>
      <eb:MessageHeader eb:version="1.0" soap-env:mustUnderstand="1" xmlns:eb="http://www.ebxml.org/namespaces/messageHeader">
         <eb:From>
            <eb:PartyId eb:type="URI">Server</eb:PartyId>
         </eb:From>
         <eb:To>
            <eb:PartyId eb:type="URI">Client</eb:PartyId>
         </eb:To>
         <eb:CPAId>IPCC</eb:CPAId>
         <eb:ConversationId>9DB7_921682_1204548352874</eb:ConversationId>
         <eb:Service>GetPassengerDataRQ</eb:Service>
         <eb:Action>GetPassengerDataRS</eb:Action>
         <eb:MessageData>
            <eb:MessageId>2860380175211760</eb:MessageId>
            <eb:Timestamp>2017-02-08T10:33:38</eb:Timestamp>
            <eb:RefToMessageId>mid:1</eb:RefToMessageId>
         </eb:MessageData>
      </eb:MessageHeader>
      <wsse:Security xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext">
         <wsse:BinarySecurityToken valueType="String" EncodingType="wsse:Base64Binary">Shared/IDL:IceSess\/SessMgr:1\.0.IDL/Common/!ICESMS\/STSB!ICESMSLB\/STS.LB!-3309817871765691227!27385!0</wsse:BinarySecurityToken>
      </wsse:Security>
   </soap-env:Header>
   <soap-env:Body>
      <ns3:GetPassengerDataRS xmlns:ns3="http://services.sabre.com/checkin/getPassengerData/v4" xmlns:ns2="http://services.sabre.com/STL/v3">
         <PassengerDataResponseList>
            <PassengerDataResponse>
               <LineNumber>1</LineNumber>
               <LastName>DAVIES</LastName>
               <FirstName>CHACKO</FirstName>
               <PassengerID>430DAFCB0001</PassengerID>
               <PNRLocator nameAssociationID="1">RLDSWM</PNRLocator>
               <BaggageRouteList>
                  <ns2:BaggageRoute>
                     <ns2:SegmentID>1</ns2:SegmentID>
                     <ns2:Airline>EY</ns2:Airline>
                     <ns2:Flight>7</ns2:Flight>
                     <ns2:BookingClass>Y</ns2:BookingClass>
                     <ns2:OperatingAirline>EY</ns2:OperatingAirline>
                     <ns2:OperatingFlight>7</ns2:OperatingFlight>
                     <ns2:Origin>AUH</ns2:Origin>
                     <ns2:Destination>FRA</ns2:Destination>
                     <ns2:DepartureDate>2017-02-09</ns2:DepartureDate>
                     <ns2:DepartureTime>09:05AM</ns2:DepartureTime>
                     <ns2:ArrivalDate>2017-02-09</ns2:ArrivalDate>
                     <ns2:ArrivalTime>01:20PM</ns2:ArrivalTime>
                     <ns2:SegmentStatus>HK</ns2:SegmentStatus>
                     <ns2:PassengerID>430DAFCB0001</ns2:PassengerID>
                  </ns2:BaggageRoute>
               </BaggageRouteList>
               <PassengerItineraryList>
                  <PassengerItinerary>
                     <SegmentID>1</SegmentID>
                     <Airline>EY</Airline>
                     <Flight>7</Flight>
                     <BookingClass>Y</BookingClass>
                     <Origin>AUH</Origin>
                     <Destination>FRA</Destination>
                     <DepartureDate>2017-02-09</DepartureDate>
                     <AircraftType>333</AircraftType>
                     <Cabin>Y</Cabin>
                     <PassengerType>F</PassengerType>
                     <BagCount>0</BagCount>
                     <TotalBagWeightAndUnit>0</TotalBagWeightAndUnit>
                     <EditCodeList>
                        <ns2:EditCode>INF</ns2:EditCode>
                        <ns2:EditCode>DOCS</ns2:EditCode>
                        <ns2:EditCode>APP</ns2:EditCode>
                     </EditCodeList>
                     <RequiredInfoList>
                        <RequiredInfo>
                           <Code>GENDER</Code>
                           <DetailStatus>ValidationRequired</DetailStatus>
                           <FreeText>ENTER GENDER FOR PSGR</FreeText>
                        </RequiredInfo>
                        <RequiredInfo>
                           <Code>DOCV</Code>
                           <DetailStatus>ValidationRequired</DetailStatus>
                           <FreeText>!VERIFY TRAVEL DOCUMENT DATA, THEN ADD DOCV</FreeText>
                        </RequiredInfo>
                        <RequiredInfo>
                           <Code>TIM</Code>
                           <DetailStatus>ValidationRequired</DetailStatus>
                           <FreeText>TIM-TIMATIC STATUS REQUIRED</FreeText>
                        </RequiredInfo>
                        <RequiredInfo>
                           <Code>TIM/INF</Code>
                           <DetailStatus>ValidationRequired</DetailStatus>
                           <FreeText>TIM-INF TIMATIC STATUS REQUIRED</FreeText>
                        </RequiredInfo>
                        <RequiredInfo>
                           <Code>DOCS_VAL</Code>
                           <DetailStatus>ValidationFailed</DetailStatus>
                           <FreeText>16011 - PLEASE VALIDATE PASSPORT NUMBER</FreeText>
                        </RequiredInfo>
                     </RequiredInfoList>
                  </PassengerItinerary>
               </PassengerItineraryList>
               <RequiredInfoSumList>
                  <RequiredInfo>
                     <Code>GENDER</Code>
                     <DetailStatus>ValidationRequired</DetailStatus>
                     <FreeText>ENTER GENDER FOR PSGR</FreeText>
                  </RequiredInfo>
                  <RequiredInfo>
                     <Code>DOCV</Code>
                     <DetailStatus>ValidationRequired</DetailStatus>
                     <FreeText>!VERIFY TRAVEL DOCUMENT DATA, THEN ADD DOCV</FreeText>
                  </RequiredInfo>
                  <RequiredInfo>
                     <Code>TIM</Code>
                     <DetailStatus>ValidationRequired</DetailStatus>
                     <FreeText>TIM-TIMATIC STATUS REQUIRED</FreeText>
                  </RequiredInfo>
                  <RequiredInfo>
                     <Code>TIM/INF</Code>
                     <DetailStatus>ValidationRequired</DetailStatus>
                     <FreeText>TIM-INF TIMATIC STATUS REQUIRED</FreeText>
                  </RequiredInfo>
                  <RequiredInfo>
                     <Code>DOCS_VAL</Code>
                     <DetailStatus>ValidationFailed</DetailStatus>
                     <FreeText>16011 - PLEASE VALIDATE PASSPORT NUMBER</FreeText>
                  </RequiredInfo>
               </RequiredInfoSumList>
               <FreeTextInfoList>
                  <ns2:FreeTextInfo>
                     <ns2:EditCode>INF</ns2:EditCode>
                     <ns2:TextLine>
                        <ns2:Text>BABY BOY,6MO</ns2:Text>
                     </ns2:TextLine>
                  </ns2:FreeTextInfo>
                  <ns2:FreeTextInfo>
                     <ns2:EditCode>DOCS</ns2:EditCode>
                     <ns2:TextLine>
                        <ns2:Text>P/US/756736512/US/01JAN70/F/01JAN19/ALPHA/PAX</ns2:Text>
                     </ns2:TextLine>
                  </ns2:FreeTextInfo>
                  <ns2:FreeTextInfo>
                     <ns2:EditCode>DOCS</ns2:EditCode>
                     <ns2:TextLine>
                        <ns2:Text>P/US/7567/US/01JAN70/MI/01JAN19/ALPHA/PAX</ns2:Text>
                     </ns2:TextLine>
                  </ns2:FreeTextInfo>
                  <ns2:FreeTextInfo>
                     <ns2:EditCode>APP</ns2:EditCode>
                     <ns2:TextLine>
                        <ns2:Text>AE/0002/B-N/OK TO BOARD  WAIVED</ns2:Text>
                     </ns2:TextLine>
                  </ns2:FreeTextInfo>
                  <ns2:FreeTextInfo>
                     <ns2:EditCode>APP</ns2:EditCode>
                     <ns2:TextLine>
                        <ns2:Text>AE/0002/B-N/INF-OK TO BOARD  WAIVED</ns2:Text>
                     </ns2:TextLine>
                  </ns2:FreeTextInfo>
               </FreeTextInfoList>
            </PassengerDataResponse>
         </PassengerDataResponseList>
         <Result messageId="ID-acs-int2-sgdcelab-sabre-com-41388-1486547589828-2-3955" timeStamp="2017-02-08T10:33:38.259Z">
            <ns2:Status>Success</ns2:Status>
            <ns2:CompletionStatus>Complete</ns2:CompletionStatus>
            <ns2:System>ACS-BSO</ns2:System>
         </Result>
      </ns3:GetPassengerDataRS>
   </soap-env:Body>
</soap-env:Envelope>

</SamplePayloads>